# SQL Master Data Science
SQL lessons from the Master reviewed and explained in detail.

In [2]:
#To load ipython-sql, use the following magic command:
%load_ext sql
# Next, we will only need the create_engine() function from sqlalchemy so letâ€™s import that with the following line:
from sqlalchemy import create_engine
#Connect to my PostgreSQL Database
%sql postgresql://juanfatri:@localhost/mydatabasename
#psql mydatabasename

In [35]:
#Tried special characters but found some problems. Will solve that later, for now it is not essential.
#from pgspecial.main import PGSpecial
#from pgspecial.namedqueries import NamedQueries
#%%sql
#\! pwd 
#special characters not installed... I need to install $ pip install pgspecial

## 1-Create and Delete Databases

In [51]:
#%%sql
#CREATE DATABASE networking;
#If I tried this I get and error, Databases cannot be created inside a transaction block.

## 2-Create and Delete Tables

In [52]:
%%sql
CREATE TABLE friends1 (nombre VARCHAR,
                      edad INT,
                      email VARCHAR);

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [53]:
%%sql
DROP TABLE friends1;

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [55]:
%%sql
CREATE TABLE friends1 (nombre VARCHAR,
                      edad INT,
                      email VARCHAR);

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

## 3-Populate Tables

In [58]:
%%sql
INSERT INTO friends1 VALUES ('Linoel Messi', 30, 'messi@barca.com');

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[]

In [68]:
%%sql
INSERT INTO friends1 VALUES ('Ronaldo', 34, 'r@juve.com'),('Luka',32,'l@madrid.com'),('Mario',25,'notiene'), ('Marina',24,'marina@asdf.com') , ('Renata',1, 'notiene');

 * postgresql://juanfatri:***@localhost/mydatabasename
5 rows affected.

[]

In [72]:
%%sql
INSERT INTO friends1 VALUES ('Donald Tramp', 71, 'trump@twitter.com');

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[]

In [73]:
%%sql
INSERT INTO friends1 VALUES ('Ivanka Tramp', 35);

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[]

## 4-Extracting Information

In [3]:
%%sql
SELECT * FROM friends1;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Linoel Messi', 30, 'messi@barca.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Mario', 25, 'notiene'),
 ('Marina', 24, 'marina@asdf.com'),
 ('Donald Tramp', 71, 'trump@twitter.com'),
 ('Ivanka Tramp', 35, None)]

In [76]:
%%sql
SELECT nombre, edad FROM friends1

 * postgresql://juanfatri:***@localhost/mydatabasename
10 rows affected.

[('Linoel Messi', 30),
 ('Ronaldo', 34),
 ('Luka', 32),
 ('Ronaldo', 34),
 ('Luka', 32),
 ('Mario', 25),
 ('Marina', 24),
 ('Renata', 1),
 ('Donald Tramp', 71),
 ('Ivanka Tramp', 35)]

## 5-Filtering Information

In [77]:
%%sql
SELECT * FROM friends1 WHERE edad < 25;

 * postgresql://juanfatri:***@localhost/mydatabasename
2 rows affected.

[('Marina', 24, 'marina@asdf.com'), ('Renata', 1, 'notiene')]

In [78]:
%%sql
SELECT nombre, edad FROM friends1 WHERE edad <> 24;
#can also be written: SELECT nombre, edad FROM friends1 WHERE edad != 24;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Linoel Messi', 30),
 ('Ronaldo', 34),
 ('Luka', 32),
 ('Ronaldo', 34),
 ('Luka', 32),
 ('Mario', 25),
 ('Renata', 1),
 ('Donald Tramp', 71),
 ('Ivanka Tramp', 35)]

In [4]:
%%sql
SELECT * FROM friends1 WHERE nombre LIKE '%L%';

 * postgresql://juanfatri:***@localhost/mydatabasename
3 rows affected.

[('Linoel Messi', 30, 'messi@barca.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Luka', 32, 'l@madrid.com')]

In [5]:
%%sql
SELECT * FROM friends1 WHERE UPPER(nombre) LIKE '%L%';

 * postgresql://juanfatri:***@localhost/mydatabasename
6 rows affected.

[('Linoel Messi', 30, 'messi@barca.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Donald Tramp', 71, 'trump@twitter.com')]

In [85]:
%%sql
SELECT * FROM friends1 WHERE UPPER(nombre) NOT LIKE '%L%';

 * postgresql://juanfatri:***@localhost/mydatabasename
4 rows affected.

[('Mario', 25, 'notiene'),
 ('Marina', 24, 'marina@asdf.com'),
 ('Renata', 1, 'notiene'),
 ('Ivanka Tramp', 35, None)]

In [86]:
%%sql
SELECT * FROM friends1 WHERE email IS NULL;

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[('Ivanka Tramp', 35, None)]

## 6-Delete information
There are two main options Delete and Drop:(i) Drop eliminates the table completely. (ii)Delete eliminates row selectively

In [90]:
%%sql
DELETE FROM friends1 WHERE edad<18;

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[]

## Exercise 1
â€¢Generate'Facebook' table where every person is identified with the name, age, city of residence, and email. The table should have at leas 5 rows.

â€¢Write a query to obtain Facebook friends which are younger than<18 or older than 65 years.

â€¢Write a query to obtain all facebook friends which do not reside in Madrid.

In [92]:
%%sql
CREATE TABLE facebook2 (name VARCHAR,
                       age INT,
                       residence VARCHAR,
                       email VARCHAR);

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [93]:
%%sql
INSERT INTO facebook2 VALUES ('Ronaldo', 34, 'Tomares', 'r@juve.com'),('Luka',32, 'Valencia', 'l@madrid.com'),
('Mario',25,'Madrid', 'notiene'), ('Marina',24, 'Getafe', 'marina@asdf.com') , ('Renata',1,'Madrid', 'ren@reina.com'),
('Isabel',75, 'Trebujena', 'Isa@asdf.com') , ('Antonio',6,'Madrid', 'Tony@porcasa.com'),('Lisardo',91, 'Oviedo', 'LIsa@asdf.com') ,
('Antonia',56,'Madrid', 'Tonya@porcasa.com');

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[]

In [6]:
%%sql
SELECT * from facebook2;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Ronaldo', 34, 'Tomares', 'r@juve.com'),
 ('Luka', 32, 'Valencia', 'l@madrid.com'),
 ('Mario', 25, 'Madrid', 'notiene'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com'),
 ('Renata', 1, 'Madrid', 'ren@reina.com'),
 ('Isabel', 75, 'Trebujena', 'Isa@asdf.com'),
 ('Antonio', 6, 'Madrid', 'Tony@porcasa.com'),
 ('Lisardo', 91, 'Oviedo', 'LIsa@asdf.com'),
 ('Antonia', 56, 'Madrid', 'Tonya@porcasa.com')]

In [95]:
%%sql
SELECT * FROM facebook2 WHERE age<18 or age>65;

 * postgresql://juanfatri:***@localhost/mydatabasename
4 rows affected.

[('Renata', 1, 'Madrid', 'ren@reina.com'),
 ('Isabel', 75, 'Trebujena', 'Isa@asdf.com'),
 ('Antonio', 6, 'Madrid', 'Tony@porcasa.com'),
 ('Lisardo', 91, 'Oviedo', 'LIsa@asdf.com')]

In [8]:
%%sql
SELECT * FROM facebook2 WHERE residence !='Madrid';

 * postgresql://juanfatri:***@localhost/mydatabasename
5 rows affected.

[('Ronaldo', 34, 'Tomares', 'r@juve.com'),
 ('Luka', 32, 'Valencia', 'l@madrid.com'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com'),
 ('Isabel', 75, 'Trebujena', 'Isa@asdf.com'),
 ('Lisardo', 91, 'Oviedo', 'LIsa@asdf.com')]

## 7-Primary Key

In [40]:
%%sql
SELECT * FROM friends1;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Linoel Messi', 30, 'messi@barca.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Mario', 25, 'notiene'),
 ('Marina', 24, 'marina@asdf.com'),
 ('Donald Tramp', 71, 'trump@twitter.com'),
 ('Ivanka Tramp', 35, None)]

In [45]:
#primary key can be added to existing table
%%sql
ALTER TABLE friends1 ADD PRIMARY KEY(email);

SyntaxError: invalid syntax (<ipython-input-45-b1c1cd846f16>, line 3)

## 8-Editing table structure

In [11]:
%%sql
ALTER TABLE friends1 ADD COLUMN telefono VARCHAR;

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [14]:
%%sql
SELECT * FROM friends1;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Linoel Messi', 30, 'messi@barca.com', None),
 ('Ronaldo', 34, 'r@juve.com', None),
 ('Luka', 32, 'l@madrid.com', None),
 ('Ronaldo', 34, 'r@juve.com', None),
 ('Luka', 32, 'l@madrid.com', None),
 ('Mario', 25, 'notiene', None),
 ('Marina', 24, 'marina@asdf.com', None),
 ('Donald Tramp', 71, 'trump@twitter.com', None),
 ('Ivanka Tramp', 35, None, None)]

In [15]:
%%sql 
ALTER TABLE friends1 DROP COLUMN telefono;

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [16]:
%%sql 
SELECT * FROM friends1;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Linoel Messi', 30, 'messi@barca.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Ronaldo', 34, 'r@juve.com'),
 ('Luka', 32, 'l@madrid.com'),
 ('Mario', 25, 'notiene'),
 ('Marina', 24, 'marina@asdf.com'),
 ('Donald Tramp', 71, 'trump@twitter.com'),
 ('Ivanka Tramp', 35, None)]

## 9- Update information inside the table

In [17]:
%%sql
SELECT * from facebook2;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Ronaldo', 34, 'Tomares', 'r@juve.com'),
 ('Luka', 32, 'Valencia', 'l@madrid.com'),
 ('Mario', 25, 'Madrid', 'notiene'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com'),
 ('Renata', 1, 'Madrid', 'ren@reina.com'),
 ('Isabel', 75, 'Trebujena', 'Isa@asdf.com'),
 ('Antonio', 6, 'Madrid', 'Tony@porcasa.com'),
 ('Lisardo', 91, 'Oviedo', 'LIsa@asdf.com'),
 ('Antonia', 56, 'Madrid', 'Tonya@porcasa.com')]

In [20]:
%%sql
UPDATE facebook2 SET residence ='Getafe';

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[]

In [21]:
%%sql 
SELECT * from facebook2;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Ronaldo', 34, 'Getafe', 'r@juve.com'),
 ('Luka', 32, 'Getafe', 'l@madrid.com'),
 ('Mario', 25, 'Getafe', 'notiene'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com'),
 ('Renata', 1, 'Getafe', 'ren@reina.com'),
 ('Isabel', 75, 'Getafe', 'Isa@asdf.com'),
 ('Antonio', 6, 'Getafe', 'Tony@porcasa.com'),
 ('Lisardo', 91, 'Getafe', 'LIsa@asdf.com'),
 ('Antonia', 56, 'Getafe', 'Tonya@porcasa.com')]

## Exercise 2
â€¢Add phone and username columns to your Facebook table.

â€¢What is the content of these two columns after their creation?

â€¢Update the phone number of all of your facebook friends

â€¢All your Facebook friends use their email as user name, so that both columns conicide.How can you take advantage of this fact when updating the user name column

In [23]:
%%sql
ALTER TABLE facebook2 ADD COLUMN phone VARCHAR;

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [24]:
%%sql
ALTER TABLE facebook2 ADD COLUMN username VARCHAR;

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [25]:
%%sql 
SELECT * from facebook2;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Ronaldo', 34, 'Getafe', 'r@juve.com', None, None),
 ('Luka', 32, 'Getafe', 'l@madrid.com', None, None),
 ('Mario', 25, 'Getafe', 'notiene', None, None),
 ('Marina', 24, 'Getafe', 'marina@asdf.com', None, None),
 ('Renata', 1, 'Getafe', 'ren@reina.com', None, None),
 ('Isabel', 75, 'Getafe', 'Isa@asdf.com', None, None),
 ('Antonio', 6, 'Getafe', 'Tony@porcasa.com', None, None),
 ('Lisardo', 91, 'Getafe', 'LIsa@asdf.com', None, None),
 ('Antonia', 56, 'Getafe', 'Tonya@porcasa.com', None, None)]

Content of the columns is None, or empty.

In [26]:
%%sql
UPDATE facebook2 SET username =email;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[]

In [30]:
%%sql
UPDATE facebook2 SET phone='666-999-1111';

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[]

In [31]:
%%sql 
SELECT * from facebook2;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Ronaldo', 34, 'Getafe', 'r@juve.com', '666-999-1111', 'r@juve.com'),
 ('Luka', 32, 'Getafe', 'l@madrid.com', '666-999-1111', 'l@madrid.com'),
 ('Mario', 25, 'Getafe', 'notiene', '666-999-1111', 'notiene'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com', '666-999-1111', 'marina@asdf.com'),
 ('Renata', 1, 'Getafe', 'ren@reina.com', '666-999-1111', 'ren@reina.com'),
 ('Isabel', 75, 'Getafe', 'Isa@asdf.com', '666-999-1111', 'Isa@asdf.com'),
 ('Antonio', 6, 'Getafe', 'Tony@porcasa.com', '666-999-1111', 'Tony@porcasa.com'),
 ('Lisardo', 91, 'Getafe', 'LIsa@asdf.com', '666-999-1111', 'LIsa@asdf.com'),
 ('Antonia', 56, 'Getafe', 'Tonya@porcasa.com', '666-999-1111', 'Tonya@porcasa.com')]

## 10-Change name of tables

In [35]:
%%sql
ALTER TABLE facebook2 RENAME TO old_facebook2;

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [38]:
%%sql
CREATE TABLE facebook2 AS SELECT
name,
age,
residence,
email FROM old_facebook2;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[]

In [39]:
%%sql
ALTER TABLE facebook2 ADD PRIMARY KEY(email);

 * postgresql://juanfatri:***@localhost/mydatabasename
Done.

[]

In [46]:
%%sql
\! cat ./my_fb_friends.csv

 * postgresql://juanfatri:***@localhost/mydatabasename
0 rows affected.

[]

In [47]:
%%sql
\copy facebook from './my_fb_friends.csv' delimiter 'Ë† ' csv header;

 * postgresql://juanfatri:***@localhost/mydatabasename

FeatureNotSupported: COPY delimiter must be a single one-byte character

## 11-Alias

In [48]:
%%sql
SELECT *, (age*2) as doub_edad from facebook2 where (age*2)>49;

 * postgresql://juanfatri:***@localhost/mydatabasename
6 rows affected.

[('Ronaldo', 34, 'Getafe', 'r@juve.com', 68),
 ('Luka', 32, 'Getafe', 'l@madrid.com', 64),
 ('Mario', 25, 'Getafe', 'notiene', 50),
 ('Isabel', 75, 'Getafe', 'Isa@asdf.com', 150),
 ('Lisardo', 91, 'Getafe', 'LIsa@asdf.com', 182),
 ('Antonia', 56, 'Getafe', 'Tonya@porcasa.com', 112)]

In [50]:
%%sql
SELECT * FROM facebook2 AS t WHERE t.residence = 'Valencia';

 * postgresql://juanfatri:***@localhost/mydatabasename
0 rows affected.

[]

## 12-Eliminating duplicates

In [53]:
%%sql
SELECT DISTINCT residence FROM facebook2;

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[('Getafe',)]

## 13-Sorting the results

In [55]:
%%sql
SELECT * FROM facebook2 ORDER BY age;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Renata', 1, 'Getafe', 'ren@reina.com'),
 ('Antonio', 6, 'Getafe', 'Tony@porcasa.com'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com'),
 ('Mario', 25, 'Getafe', 'notiene'),
 ('Luka', 32, 'Getafe', 'l@madrid.com'),
 ('Ronaldo', 34, 'Getafe', 'r@juve.com'),
 ('Antonia', 56, 'Getafe', 'Tonya@porcasa.com'),
 ('Isabel', 75, 'Getafe', 'Isa@asdf.com'),
 ('Lisardo', 91, 'Getafe', 'LIsa@asdf.com')]

In [57]:
%%sql
SELECT * FROM facebook2 ORDER BY age DESC;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Lisardo', 91, 'Getafe', 'LIsa@asdf.com'),
 ('Isabel', 75, 'Getafe', 'Isa@asdf.com'),
 ('Antonia', 56, 'Getafe', 'Tonya@porcasa.com'),
 ('Ronaldo', 34, 'Getafe', 'r@juve.com'),
 ('Luka', 32, 'Getafe', 'l@madrid.com'),
 ('Mario', 25, 'Getafe', 'notiene'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com'),
 ('Antonio', 6, 'Getafe', 'Tony@porcasa.com'),
 ('Renata', 1, 'Getafe', 'ren@reina.com')]

In [72]:
%%sql
SELECT * FROM facebook2 ORDER BY age, name;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Renata', 1, 'Getafe', 'ren@reina.com'),
 ('Antonio', 6, 'Getafe', 'Tony@porcasa.com'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com'),
 ('Mario', 25, 'Getafe', 'notiene'),
 ('Luka', 32, 'Getafe', 'l@madrid.com'),
 ('Ronaldo', 34, 'Getafe', 'r@juve.com'),
 ('Antonia', 56, 'Getafe', 'Tonya@porcasa.com'),
 ('Isabel', 75, 'Getafe', 'Isa@asdf.com'),
 ('Lisardo', 91, 'Getafe', 'LIsa@asdf.com')]

In [81]:
# And limit the number of results
%%sql
SELECT * FROM facebook2
ORDER BY age DESC
LIMIT 5;

SyntaxError: invalid syntax (<ipython-input-81-c22ef8ed3e0c>, line 3)

In [80]:
# with offset we can start counting at a specific line.
%%sql
SELECT * FROM facebook2 
ORDER BY age DESC 
OFFSET 5 
LIMIT 3;

 * postgresql://juanfatri:***@localhost/mydatabasename
3 rows affected.

[('Mario', 25, 'Getafe', 'notiene'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com'),
 ('Antonio', 6, 'Getafe', 'Tony@porcasa.com')]

## 14-Local operators
AND
BETWEEN
IN 
OR
NOT

In [84]:
%%sql
SELECT * FROM facebook2 WHERE age BETWEEN 18 AND 30;

 * postgresql://juanfatri:***@localhost/mydatabasename
2 rows affected.

[('Mario', 25, 'Getafe', 'notiene'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com')]

In [85]:
%%sql
SELECT * FROM facebook2 WHERE age NOT IN (24,32,34);

 * postgresql://juanfatri:***@localhost/mydatabasename
6 rows affected.

[('Mario', 25, 'Getafe', 'notiene'),
 ('Renata', 1, 'Getafe', 'ren@reina.com'),
 ('Isabel', 75, 'Getafe', 'Isa@asdf.com'),
 ('Antonio', 6, 'Getafe', 'Tony@porcasa.com'),
 ('Lisardo', 91, 'Getafe', 'LIsa@asdf.com'),
 ('Antonia', 56, 'Getafe', 'Tonya@porcasa.com')]

## 15-Aggregate functions

In [86]:
%%sql
SELECT COUNT(*) FROM facebook2;

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[(9,)]

In [87]:
%%sql
SELECT AVG(age), MIN(age), MAX(age) FROM facebook2;

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[(Decimal('38.2222222222222222'), 1, 91)]

## 16-Group By

In [88]:
%%sql
SELECT residence, count(*), AVG(age)
FROM facebook2
GROUP BY residence;

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[('Getafe', 9, Decimal('38.2222222222222222'))]

In [89]:
%%sql
SELECT residence, count(*), age
FROM facebook2
GROUP BY residence, age;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Getafe', 1, 56),
 ('Getafe', 1, 24),
 ('Getafe', 1, 91),
 ('Getafe', 1, 75),
 ('Getafe', 1, 1),
 ('Getafe', 1, 25),
 ('Getafe', 1, 34),
 ('Getafe', 1, 32),
 ('Getafe', 1, 6)]

In [95]:
%%sql
SELECT residence, count(*), AVG(age)
FROM facebook2
GROUP BY residence HAVING AVG(age)>20;

 * postgresql://juanfatri:***@localhost/mydatabasename
1 rows affected.

[('Getafe', 9, Decimal('38.2222222222222222'))]

## 17-Multiple queries

In [96]:
%%sql
SELECT *, ( SELECT AVG(age)
FROM facebook2
WHERE residence='Madrid' ) AS Mad_average
FROM facebook2;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Ronaldo', 34, 'Getafe', 'r@juve.com', None),
 ('Luka', 32, 'Getafe', 'l@madrid.com', None),
 ('Mario', 25, 'Getafe', 'notiene', None),
 ('Marina', 24, 'Getafe', 'marina@asdf.com', None),
 ('Renata', 1, 'Getafe', 'ren@reina.com', None),
 ('Isabel', 75, 'Getafe', 'Isa@asdf.com', None),
 ('Antonio', 6, 'Getafe', 'Tony@porcasa.com', None),
 ('Lisardo', 91, 'Getafe', 'LIsa@asdf.com', None),
 ('Antonia', 56, 'Getafe', 'Tonya@porcasa.com', None)]

In [97]:
%%sql
SELECT *
FROM facebook2
WHERE residence IN (SELECT residence
FROM facebook2
GROUP BY residence
HAVING AVG(age)>35) ;

 * postgresql://juanfatri:***@localhost/mydatabasename
9 rows affected.

[('Ronaldo', 34, 'Getafe', 'r@juve.com'),
 ('Luka', 32, 'Getafe', 'l@madrid.com'),
 ('Mario', 25, 'Getafe', 'notiene'),
 ('Marina', 24, 'Getafe', 'marina@asdf.com'),
 ('Renata', 1, 'Getafe', 'ren@reina.com'),
 ('Isabel', 75, 'Getafe', 'Isa@asdf.com'),
 ('Antonio', 6, 'Getafe', 'Tony@porcasa.com'),
 ('Lisardo', 91, 'Getafe', 'LIsa@asdf.com'),
 ('Antonia', 56, 'Getafe', 'Tonya@porcasa.com')]

In [102]:
%%sql
SELECT * FROM facebook2
WHERE usuario = ANY (SELECT name FROM friends1 WHERE nombre LIKE '%a%â€˜);

 * postgresql://juanfatri:***@localhost/mydatabasename
(psycopg2.errors.SyntaxError) unterminated quoted string at or near "'%a%â€˜);"
LINE 2: ...o = ANY (SELECT name FROM friends1 WHERE nombre LIKE '%a%â€˜);
                                                                ^
 [SQL: "SELECT * FROM facebook2\nWHERE usuario = ANY (SELECT name FROM friends1 WHERE nombre LIKE '%%a%%â€˜);"] (Background on this error at: http://sqlalche.me/e/f405)

In [103]:
%%sql
\! ls

 * postgresql://juanfatri:***@localhost/mydatabasename
0 rows affected.

[]

In [104]:
ls

00_Import
5-6 Juan.ipynb
Applications/
Ch_1_Juan
Desktop/
Documents/
Downloads/
Library/
Movies/
Music/
OneDrive - GAS Natural InformÃ¡tica, S.A/
Pictures/
Public/
SQL_MDC.ipynb
Untitled.ipynb
Untitled1.ipynb
Untitled2.ipynb
anaconda3/
aplicacion0/
boulder-precip.csv
dash1.py
ds13nlp/
env-nlp/
file
linkedin
logfile
my_fb_friends.csv
nltk_data/
one/
postgres/
prueba.Rmd
prueba.html
psql_create_contactos.sq
psql_create_contactos.sql
repos/
spark/

In [106]:
## upload to github all the documents
##continue with the pending issues.
## try to solve the unsolved issues.